{
  "general": {
    "today": "Heute",
    "download_cv": "Lebenslauf herunterladen",
    "issued": "Ausgestellt",
    "years": "jahre",
    "subject": "Betreff",
    "message": "Nachricht",
    "send_message": "Nachricht senden"
  },
  "home": {
    "titleHello": "Hallo ✌️",
    "title": "Ich bin Miloš",
    "subtitle": "Autodidaktischer Senior Webentwickler: Grenzen überschreiten, um herausragende, benutzerorientierte digitale Lösungen zu liefern"
  },
  "titles": {
    "about": "Über mich",
    "education_and_work": "Bildung und Berufserfahrung",
    "work": "Berufserfahrung",
    "education": "Bildung",
    "services": "Meine Dienstleistungen",
    "contact": "Kontakt",
    "front_end_tech_stack": "Frontend-Technologie-Stack",
    "back_end_tech_stack": "Backend-Technologie-Stack",
    "designer_tools": "Designer-Tools",
    "web_polishing": "Web-Feinschliff",
    "mobile_tech_stack": "Mobile Technologie-Stack"
  },
  "subtitles": {
    "services": "Wenn Sie sich fragen was ich machen…",
    "contact": "Füllen Sie einfach das untenstehende Formular mit Ihrer Nachricht aus, klicken Sie auf 'Senden' und ich werde mich schneller bei Ihnen melden als eine React-Komponente, die auf einer Hochgeschwindigkeitsverbindung gerendert wird. 😄"
  },
  "about": {
    "firstParagraph": "Ich bin <strong>Miloš</strong>, ein 27-jähriger autodidaktischer <strong>Full Stack Entwickler</strong> aus Serbien, der in <strong>Reykjavik, Island</strong> <strong>wohnt</strong>.",
    "secondParagraph": "Nach der High School begann ich meine Karriere als <strong>Webentwickler</strong>, wo ich ein Jahr blieb. In dieser Zeit erstellte ich über <strong>100 einfache HTML- und CSS-Websites</strong> basierend auf bereitgestellten Designs und entwickelte bis zu <strong>15 WordPress-Websites</strong>—einige mit <strong>benutzerdefinierten Themes</strong> und andere mit gekauften Vorlagen. Nach einem Jahr erkannte ich, dass ich <strong>nicht vorankam</strong> und <strong>neue Herausforderungen brauchte, um weiter zu wachsen</strong>.",
    "thirdParagraph": "Im <strong>März 2018</strong> sicherte ich mir dank eines ehemaligen Kollegen einen neuen Job, der es mir ermöglichte, <strong>neue Technologien zu erkunden</strong>. Ich tauchte in die Welt von <strong>JavaScript</strong> und <strong>PHP</strong> ein und lernte viel durch den Bau einer <strong>mobilen Web-App</strong> in <strong>PHP</strong> und einer Website mit einem <strong>benutzerdefinierten Backend</strong>. Nach einem Jahr führte jedoch der <strong>Mangel an neuen Projekten</strong> dazu, dass ich mich erneut stagnierend fühlte.",
    "fourthParagraph": "Entschlossen, meine Fähigkeiten zu erweitern, begann ich in meiner Freizeit <strong>ReactJS</strong> zu studieren und <strong>verliebte mich in JavaScript und React</strong>. Ein Kollege und ich entschieden uns, eine <strong>Flugbuchungsplattform</strong> zu bauen, was mich dazu brachte, <strong>AngularJS</strong> zu lernen. Ich baute das gesamte Buchungssystem mit Online-Zahlung in <strong>AngularJS</strong>, erkannte aber später, dass <strong>ReactJS</strong> besser zu meinen Interessen passte, also baute ich das System mit <strong>ReactJS</strong> neu auf.",
    "fifthParagraph": "Im <strong>April 2019</strong> nahm ich ein Jobangebot an, das es mir ermöglichte, mich auf <strong>persönliches Wachstum und Entwicklung</strong> zu konzentrieren. Während meiner Zeit in diesem Unternehmen entwickelte ich mich erheblich als Entwickler weiter und nahm die Denkweise eines <strong>Full Stack Entwicklers</strong> an. Ich vertiefte mich in verschiedene Technologien wie <strong>Laravel</strong>, <strong>Vue.js</strong> und <strong>NativeScript</strong> für die App-Entwicklung.",
    "sixthParagraph": "Im <strong>Juni 2022</strong> traf ich die schwierige Entscheidung, meine Position bei <strong>Morph Networks</strong> zu verlassen, wo ich seit 2019 gearbeitet hatte. Dankbar für die Erfahrungen und Wachstumsmöglichkeiten, fühlte ich, dass es Zeit für eine neue Herausforderung war, und nahm mir etwas Zeit, um über meine nächsten Schritte nachzudenken.",
    "seventhParagraph": "Im <strong>Oktober 2022</strong> zog ich nach <strong>Reykjavik, Island</strong>, und begann ein aufregendes neues Kapitel in meinem Leben. Ich startete eine neue Position bei <strong>Sidekick Health</strong> als <strong>Senior Webentwickler</strong>, spezialisiert auf <strong>TypeScript</strong> und <strong>ReactJS</strong>. Der Umzug war sowohl spannend als auch beängstigend, aber ich war bestrebt, sowohl persönlich als auch beruflich zu wachsen.",
    "eighthParagraph": "Im <strong>Jahr 2023</strong> machte ich einen weiteren bedeutenden Schritt, indem ich mich für ein <strong>Bachelor of Science</strong>-Programm in <strong>Informatik</strong> an der <strong>Universität Reykjavik</strong> einschrieb. Derzeit, im <strong>Jahr 2024</strong>, bin ich in meinem <strong>zweiten Jahr</strong> (drittes Semester), wo ich meine <strong>Python</strong>-Fähigkeiten durch verschiedene Universitätsprojekte, die intensiv Python nutzen, erheblich verbessert habe.",
    "ninthParagraph": "Bei der Arbeit erweiterte ich meine Expertise, indem ich zum Backend mit <strong>Java</strong> beitrug und End-to-End-Tests in <strong>Cypress</strong> schrieb, um die Qualität des Portals, das wir entwickeln, zu verbessern. Wir wechselten von einer <strong>RESTful API</strong> zu <strong>GraphQL</strong>, was mein Skillset weiter erweiterte. Ich führte auch die <strong>React Query</strong>-Bibliothek in unseren Frontend-Stack ein, was die Leistung und Zuverlässigkeit unserer Software drastisch verbesserte.",
    "tenthParagraph": "Im <strong>Jahr 2024</strong> begann ich ein aufregendes Projekt: die Entwicklung einer <strong>Android</strong>- und <strong>iOS</strong>-App von Grund auf für ein <strong>Transportunternehmen</strong>. Die App fungiert als Navigationswerkzeug, ermöglicht es Benutzern, LKWs zu verfolgen, Ladungen und Entladungen zu verwalten, Stopps anzusehen und hinzuzufügen, Grenzübertritte zu bearbeiten und Rechnungen während des Transports einzugeben. Durch dieses Projekt verfeinerte ich meine Fähigkeiten in <strong>React Native</strong> und fügte mobile App-Entwicklung zu meinem Repertoire hinzu.",
    "eleventhParagraph": "Meine Reise war eine unglaubliche Achterbahnfahrt des Lernens und der Selbstentdeckung. Vom autodidaktischen <strong>Full Stack Entwickler</strong> in Serbien bis zum <strong>Senior Webentwickler</strong> und <strong>Informatik</strong>-Studenten in Island habe ich kontinuierlich nach Möglichkeiten gesucht, zu wachsen und mich herauszufordern. Diese Erfahrungen haben mich sowohl persönlich als auch beruflich geprägt, und ich bin gespannt, wohin die Zukunft mich führen wird."
  },
  "services": [
    {
      "id": 0,
      "title": "Frontend",
      "icon": "FrontendIcon",
      "description": "Ich helfe Start-ups, kleinen Unternehmen und Agenturen dabei, hochwertige Websites und eine außergewöhnliche Benutzererfahrung zu erreichen. Die Technologien, mit denen ich am meisten vertraut bin, sind HTML, CSS, JavaScript, VueJS, React und NativeScript (für mobile Anwendungen)."
    },
    {
      "id": 1,
      "title": "Backend",
      "icon": "BackendIcon",
      "description": "Es geht nicht nur darum, Server, Anwendungen und Datenbanken miteinander kommunizieren zu lassen. Es geht darum, ein Produkt zu entwickeln, das nahtlos funktioniert, auf die Marktbedürfnisse eingeht und eine angenehme Benutzererfahrung schafft, die die Loyalität Ihrer Kunden verdient."
    },
    {
      "id": 2,
      "title": "UI/UX",
      "icon": "UiUxIcon",
      "description": "Sie möchten, dass Ihre Website genau so aussieht, wie sie ursprünglich von den Designern gestaltet wurde? Ich bin verantwortlich für die Anwendung interaktiver und visueller Gestaltungsprinzipien auf Ihren Websites und Webanwendungen für ein positives und stimmiges Benutzererlebnis."
    },
    {
      "id": 3,
      "title": "API-Entwicklung",
      "icon": "ApiIcon",
      "description": "Die Erstellung von Schnittstellen zwischen verschiedenen Systemen zum Datenaustausch ist eine moderne Anforderung, die die Entwicklung von Anwendungsprogrammierschnittstellen (APIs) und Webservices erfüllt."
    },
    {
      "id": 4,
      "title": "WordPress oder individuelles CMS",
      "icon": "WordpressIcon",
      "description": "Sie benötigen eine Website, die Sie einfach bearbeiten und verwalten können, wie zum Beispiel eine Blog-Website, ein Portfolio oder sogar einen großen Online-Shop? Ich erstelle für Sie eine einzigartige WordPress- oder individuelle CMS-Website, die Ihren Anforderungen entspricht."
    },
    {
      "id": 5,
      "title": "Bereitstellung",
      "icon": "DeploymentIcon",
      "description": "Das Bereitstellen - oder das Übertragen neuer Codes auf einen Server - ist ein integraler Bestandteil des täglichen Arbeitsablaufs eines Entwicklers. Nach der Bereitstellung muss die Website mit der Google-Suche verbunden und alle Seitengeschwindigkeitstests bestanden werden."
    }
  ]
}
