{
  "general": {
    "today": "Today",
    "download_cv": "Download CV",
    "issued": "Issued",
    "years": "years",
    "subject": "Subject",
    "message": "Message",
    "send_message": "Send Message"
  },
  "home": {
    "titleHello": "Hello ✌️",
    "title": "I'm Miloš",
    "subtitle": "Self-taught Senior Web Developer: Pushing Boundaries to Deliver Outstanding, User-Focused Digital Solutions"
  },
  "titles": {
    "about": "My journey and myself",
    "education_and_work": "Education and Work Experience",
    "work": "Work Experience",
    "education": "Education",
    "services": "My Services",
    "contact": "Let's Connect",
    "front_end_tech_stack": "Front End Tech Stack",
    "back_end_tech_stack": "Back End Tech Stack",
    "designer_tools": "Designer Tools",
    "web_polishing": "Web Polishing",
    "mobile_tech_stack": "Mobile Tech Stack"
  },
  "subtitles": {
    "services": "If you’re wondering what I do…",
    "contact": "Just fill out the form below with your message, click 'Send', and I'll get back to you faster than a React component rendering on a high-speed connection. 😄"
  },
  "about": {
    "firstParagraph": "I’m <strong>Miloš</strong>, a 27 years old self-taught <strong>Full Stack developer</strong>, from Serbia <strong>residing</strong> in <strong>Reykjavik, Iceland</strong>.",
    "secondParagraph": "After high school, I began my career as a <strong>web developer</strong>, where I stayed for one year. During this time, I created over <strong>100 simple HTML and CSS websites</strong> based on provided designs and developed up to <strong>15 WordPress websites</strong>—some with <strong>custom themes</strong> and others using purchased templates. After a year, I realized I was <strong>not progressing</strong> and <strong>needed new challenges to continue growing</strong>.",
    "thirdParagraph": "In <strong>March 2018</strong>, thanks to a former colleague, I secured a new job that allowed me to <strong>explore new technologies</strong>. I delved into the world of <strong>JavaScript</strong> and <strong>PHP</strong>, learning a great deal by building a <strong>mobile web app</strong> in <strong>PHP</strong> and a website with a <strong>custom backend</strong>. However, after a year, the <strong>lack of new projects</strong> led me to feel stagnant once again.",
    "fourthParagraph": "Determined to advance my skills, I started studying <strong>ReactJS</strong> in my free time and <strong>fell in love with JavaScript and React</strong>. A colleague and I decided to build a <strong>flight booking engine</strong>, which led me to learn <strong>AngularJS</strong>. I built the entire booking system with online payment in <strong>AngularJS</strong> but later realized that <strong>ReactJS</strong> was a better fit for my interests, so I rebuilt the system using <strong>ReactJS</strong>.",
    "fifthParagraph": "In <strong>April 2019</strong>, I accepted a job offer that enabled me to focus on <strong>personal growth and development</strong>. During my time at this company, I evolved significantly as a developer, embracing the mindset of a <strong>Full Stack Developer</strong>. I immersed myself in various technologies such as <strong>Laravel</strong>, <strong>Vue.js</strong>, and <strong>NativeScript</strong> for app development.",
    "sixthParagraph": "In <strong>June 2022</strong>, I made the difficult decision to leave my position at <strong>Morph Networks</strong>, where I had been working since 2019. Grateful for the experiences and growth opportunities, I felt it was time for a new challenge and took some time to reflect on my next steps.",
    "seventhParagraph": "In <strong>October 2022</strong>, I relocated to <strong>Reykjavik, Iceland</strong>, embracing an exciting new chapter in my life. I started a new position at <strong>Sidekick Health</strong> as a <strong>Senior Web Developer</strong>, specializing in <strong>TypeScript</strong> and <strong>ReactJS</strong>. The move was both thrilling and daunting, but I was eager to grow both personally and professionally.",
    "eighthParagraph": "In <strong>2023</strong>, I took another significant step by enrolling in a <strong>Bachelor of Science</strong> program in <strong>Computer Science</strong> at <strong>Reykjavik University</strong>. Currently, in <strong>2024</strong>, I am in my <strong>second year</strong> (third semester), where I’ve significantly enhanced my <strong>Python</strong> skills through various university projects that extensively use Python.",
    "ninthParagraph": "At work, I expanded my expertise by contributing to the backend using <strong>Java</strong> and writing end-to-end tests in <strong>Cypress</strong> to improve the quality of the portal we are developing. We transitioned from a <strong>RESTful API</strong> to <strong>GraphQL</strong>, further broadening my skill set. I also introduced the <strong>React Query</strong> library to our frontend stack, which drastically improved our software’s performance and reliability.",
    "tenthParagraph": "In <strong>2024</strong>, I embarked on an exciting project: developing an <strong>Android</strong> and <strong>iOS</strong> app from scratch for a <strong>trucking company</strong>. The app functions as a navigation tool, allowing users to track trucks, manage loads and unloads, view and add stops, handle border crossings, and input bills during shipments. Through this project, I honed my skills in <strong>React Native</strong>, adding mobile app development to my repertoire.",
    "eleventhParagraph": "My journey has been an incredible rollercoaster of learning and self-discovery. From a self-taught <strong>Full Stack Developer</strong> in Serbia to a <strong>Senior Web Developer</strong> and <strong>Computer Science</strong> student in Iceland, I have continuously sought opportunities to grow and challenge myself. These experiences have shaped me both personally and professionally, and I’m excited to see where the future takes me."
  },
  "services": [
    {
      "id": 0,
      "title": "Front End",
      "icon": "FrontendIcon",
      "description": "Helping start-ups, small businesses and agencies achieve high quality websites and exceptional user experience. Technologies I am most experienced with are HTML, CSS, JavaScript, VueJS, React and NativeScript (for mobile applications)."
    },
    {
      "id": 1,
      "title": "Back End",
      "icon": "BackendIcon",
      "description": "It's not just about making a server, application, and database communicate with each other. It's about building a product that works seamlessly, meets market needs and creating an enjoyable user experience that earns your clients loyalty."
    },
    {
      "id": 2,
      "title": "UI/UX",
      "icon": "UiUxIcon",
      "description": "You want the website to look exactly how designers initially designed it? I am responsible for applying interactive and visual design principles on your websites and web applications for a positive and cohesive user experience."
    },
    {
      "id": 3,
      "title": "API development",
      "icon": "ApiIcon",
      "description": "Creating interfaces between different systems to share data is a modern requirement that the development of application programming interfaces (APIs) and web services fulfils."
    },
    {
      "id": 4,
      "title": "WordPress or Custom CMS",
      "icon": "WordpressIcon",
      "description": "You need a website that you can easily edit and manage such as a blog website, portfolio or even a big online shop? I will build you a WordPress or Custom CMS unique website that suits your needs."
    },
    {
      "id": 5,
      "title": "Deployment",
      "icon": "DeploymentIcon",
      "description": "Deploying— or pushing new code to a server— is an integral part of a developer’s daily workflow. After deployment, it needs to be connected with Google search and pass all page speed tests."
    }
  ]
}
